Autodesk.Revit.DB.SiteLocation.GetGeolocationBase
Returns:
For a Site containing a GeolocationBase, returns the properties associated with it, null if no geolocation base exists.

Autodesk.Revit.DB.SiteLocation.IsGeolocated
Returns:
true if the Site contains a geolocationDefinition AND that definition is not a place holder or "Engineering" type geolocation.

Autodesk.Revit.DB.SiteLocation.SetBasicGeolocationWithDatum(Autodesk.Revit.DB.Geolocation.GeographicalCoordinate,System.Double,System.Double,System.Double,System.String,System.String)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.SiteLocation.GetEPSGCode
Get the EPSG code of the geographic coordinate system, return -1 if the site does not have a geographic coordinate system or the coordinate system is not defined by an EPSG code.
Returns:
Get the EPSG code of the geographic coordinate system, return -1 if the coordinate system is not EPSG or no coordinate system.
Since:
2027

Autodesk.Revit.DB.SiteLocation.GetGeoCoordinateSystem(System.String)
Loads the specified Custom Coordinate System.
name:
Name of the custom coordinate system to load.
Returns:
XML representation of the coordinate system
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InternalException:
Unknown failure has happened during the operation.

Autodesk.Revit.DB.SiteLocation.InitGeoCoordinateSystem
internal initialization of  GeoLocation System.

Autodesk.Revit.DB.SiteLocation.SetLatitudeAndLongitude(System.Double,System.Double,System.Boolean)
Sets the latitude and longitude and optionally updates the city and time zone information.
latitude:
The latitude, in radians between -PI/2 and PI/2.
longitude:
The longitude, in radians between -PI and PI.
If the given value is not between -PI and PI, it will be shifted by multiples of 2PI until it is in range.
updateCityAndTimeZone:
If true, Revit will attempt to match the coordinates to a city it knows about,
and also attempt to automatically adjust the time zone value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The latitude value is out of range. It must be between -PI/2 and PI/2.
Since:
2027.1

Autodesk.Revit.DB.SiteLocation.GeoCoordinateSystemDefinition
The XML or WKT2 string which describes the geographic coordinate system.
Remarks:
If the site does not have a geographic coordinate system, it returns an empty string for this property.
Since:
2018